Автосервис/src/Documents/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Оплата</name>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВариантыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаряд</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.ВладельцыАвтомобилей</types>
    </type>
  </attributes>
</mdclass:Document>

Автосервис/src/InformationRegisters/СтоимостьНормаЧаса/СтоимостьНормаЧаса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьНормаЧаса</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:InformationRegister>

Автосервис/src/Documents/Оплата/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПолучитьСуммуКОплате(ЗаказНарядСсылка)
	ЗаказНаряд = ЗаказНарядСсылка.ПолучитьОбъект();
	СуммаКОплате = 0;
	Для Каждого СтрокаРаботы Из ЗаказНаряд.Работы Цикл
		СуммаКОплате = СуммаКОплате + СтрокаРаботы.ИтогСумма;
	КонецЦикла;
	Возврат СуммаКОплате;
КонецФункции

&НаКлиенте
Процедура ЗаказНарядПриИзменении(Элемент)
	ЗаказНаряд = Объект.ЗаказНаряд;
	Если ЗаказНаряд = Неопределено Тогда
		Объект.СуммаКОплате = 0;
	Иначе
		Объект.СуммаКОплате = ПолучитьСуммуКОплате(ЗаказНаряд);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПечатьЧекаНаСервере(ТабДок)
	Макет = Документы.Оплата.ПолучитьМакет("Макет");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();
	ИмяКассира = Объект.Кассир.Фамилия + " " + Объект.Кассир.Имя + " " + Объект.Кассир.Отчество;
	Если НЕ ЗначениеЗаполнено(Объект.Номер) Тогда
		Номер = "Документ не проведен. Неопределено";
	Иначе
	    Номер = Объект.Номер;
	КонецЕсли;
	Шапка.Параметры.ИмяКассира = ИмяКассира;
	Шапка.Параметры.НомерЧека = Номер;
	ТабДок.Вывести(Шапка);
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ШапкаТаблицы);
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	СуммаКОплате = Объект.СуммаКОплате;
	СтоимостьНормаЧаса = РегистрыСведений.СтоимостьНормаЧаса.ПолучитьПоследнее(Объект.ЗаказНаряд.Дата);
	
	Для Каждого СтрокаРаботы Из Объект.ЗаказНаряд.Работы Цикл
		СтрокаТаблицы.Параметры.НазваниеТовараРаботы = СтрокаРаботы.Работа.Наименование;
		СтрокаТаблицы.Параметры.Цена = СтрокаРаботы.Работа.НормаЧас * СтоимостьНормаЧаса.Стоимость;
		СтрокаТаблицы.Параметры.Количество = СтрокаРаботы.Количество;
		СтрокаТаблицы.Параметры.Сумма = СтрокаРаботы.Сумма;
		ТабДок.Вывести(СтрокаТаблицы);
		Для Каждого СтрокаДетали Из Объект.ЗаказНаряд.Автодетали Цикл
			Если СтрокаДетали.СсылкаНаРаботу = СтрокаРаботы.Работа Тогда
				Если СтрокаДетали.ДетальКлиента Тогда
					СтрокаТаблицы.Параметры.НазваниеТовараРаботы = 
						СтрокаДетали.Материал.Наименование + " " + "(деталь клиента)";
				Иначе
					СтрокаТаблицы.Параметры.НазваниеТовараРаботы = 
						СтрокаДетали.Материал.Наименование;
				КонецЕсли;
				СтрокаТаблицы.Параметры.Цена = СтрокаДетали.Цена;
				СтрокаТаблицы.Параметры.Количество = СтрокаДетали.Количество;
				СтрокаТаблицы.Параметры.Сумма = СтрокаДетали.Сумма;
				ТабДок.Вывести(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Итого = Макет.ПолучитьОбласть("Итого");
	Итого.Параметры.СуммаИтог = СуммаКОплате;
	ТабДок.Вывести(Итого);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЧекаНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры
